{
  "backend/main.mo": "Main Motoko actor defining the student information system backend with types for Students, Courses, Enrollments, Grades, Attendance, Projects, and Instructor Profiles, plus CRUD operations and access control via mixins.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of a three-dot vertical ellipsis menu in AppLayout with 'Share Website' and 'Copy Link' dropdown options.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose, covering game components, React Query hooks, UI pages, and student/course management features.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens including background, foreground, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the GemQuest Adventure app that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with eight routes (dashboard, projects, students, courses, enrollments, grades, attendance, instructors), React Query, ThemeProvider, and Toaster.",
  "frontend/src/components/attendance/AttendanceList.tsx": "Empty file placeholder for an attendance list component.",
  "frontend/src/components/attendance/AttendanceManager.tsx": "Empty file placeholder for an attendance manager component.",
  "frontend/src/components/attendance/AttendanceStatistics.tsx": "Empty file placeholder for an attendance statistics component.",
  "frontend/src/components/attendance/SessionAttendanceForm.tsx": "Empty file placeholder for a session attendance form component.",
  "frontend/src/components/auth/AuthPanel.tsx": "Authentication panel component that handles Internet Identity login/logout and displays a welcome message with the user's profile name.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that prompts newly authenticated users to enter their name and creates an admin profile via the saveCallerUserProfile mutation.",
  "frontend/src/components/courses/CourseDetail.tsx": "Read-only course detail view displaying course overview, academic requirements, instructor info, and schedule in card sections with an edit button.",
  "frontend/src/components/courses/CourseForm.tsx": "A React form component for creating or editing a Course, with fields for code, name, instructor, credits, description, schedule, location, and a dynamic prerequisites list.",
  "frontend/src/components/courses/CourseList.tsx": "Displays a searchable, filterable table of courses with view, edit, and delete action buttons for each row.",
  "frontend/src/components/enrollments/EnrollmentList.tsx": "Empty file with no content.",
  "frontend/src/components/enrollments/EnrollmentManager.tsx": "Empty file with no content.",
  "frontend/src/components/enrollments/EnrollStudentDialog.tsx": "Empty file with no content.",
  "frontend/src/components/game/controls/TouchControlsOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/game/controls/useIsTouchDevice.ts": "Empty file with no content.",
  "frontend/src/components/game/controls/usePlayerControls.ts": "Empty file with no content.",
  "frontend/src/components/game/controls/useTouchControls.ts": "Empty file with no content.",
  "frontend/src/components/game/GamePage.tsx": "Empty file with no content.",
  "frontend/src/components/game/state/gameTypes.ts": "Empty file with no content.",
  "frontend/src/components/game/state/useGameState.ts": "Empty file with no content.",
  "frontend/src/components/game/systems/collisionSystem.ts": "Empty file with no content.",
  "frontend/src/components/game/systems/spawnSystem.ts": "Empty file with no content.",
  "frontend/src/components/game/ThreeGameCanvas.tsx": "Empty file with no content.",
  "frontend/src/components/grades/GradeDetail.tsx": "Displays a detailed read-only view of a single Grade record, including assignment info, submission/due dates with late detection, and a color-coded score display.",
  "frontend/src/components/grades/GradeForm.tsx": "A React form for creating or editing a Grade, with dropdowns for student and course selection and fields for assignment name, description, score, due date, submission date, and instructor comments.",
  "frontend/src/components/grades/GradeList.tsx": "Renders a searchable table of grades with color-coded scores, late submission badges, and view/edit action buttons.",
  "frontend/src/components/grades/GradeManager.tsx": "Combines student/course filter inputs with GradeStatistics and GradeList to provide a filtered grade management view.",
  "frontend/src/components/grades/GradeStatistics.tsx": "Displays a 4-card grid of grade statistics (total assignments, average, highest, and lowest scores) calculated from an array of Grade objects.",
  "frontend/src/components/hud/ControlsHelp.tsx": "Empty file with no content.",
  "frontend/src/components/hud/HUD.tsx": "Empty file with no content.",
  "frontend/src/components/hud/SaveResetControls.tsx": "Empty file with no content.",
  "frontend/src/components/hud/SkillsPanel.tsx": "Empty file with no content.",
  "frontend/src/components/instructors/InstructorList.tsx": "Renders a searchable grid of instructor cards filtered by name or department, each showing contact info and a 'View Profile' button.",
  "frontend/src/components/instructors/InstructorProfileForm.tsx": "A form component for creating or editing an InstructorProfile, with fields for personal info, contact details, and office information.",
  "frontend/src/components/instructors/InstructorProfileView.tsx": "Displays a read-only view of an instructor's profile including bio, contact info, and office details, with an optional edit button.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with a sticky header (logo, share/copy-link menu, auth panel), navigation bar for authenticated users, and a landing prompt for unauthenticated users.",
  "frontend/src/components/layout/Navigation.tsx": "Horizontal navigation bar with links to all main app sections, highlighting the active route using TanStack Router.",
  "frontend/src/components/projects/AddProjectDialog.tsx": "A button that opens a dialog containing a ProjectForm for adding a new project.",
  "frontend/src/components/projects/ProjectForm.tsx": "A form component for adding new student projects, handling PDF file upload with progress tracking, and submitting project data (studentId, title, description, PDF) via the useAddProject mutation hook.",
  "frontend/src/components/projects/ProjectList.tsx": "Displays a filterable, sortable table of student projects with status badges, grades, submission dates, and a PDF download button.",
  "frontend/src/components/projects/ProjectManager.tsx": "Top-level project management component that lets users search projects by student ID and renders ProjectStatistics, ProjectList, and AddProjectDialog based on search results.",
  "frontend/src/components/projects/ProjectStatistics.tsx": "Renders a grid of summary stat cards (total projects, average grade, submitted count, graded count) computed from a list of Project objects.",
  "frontend/src/components/students/StudentDetail.tsx": "Read-only detail view for a single student, displaying personal, contact, and emergency contact information in cards with an Edit button to trigger an edit callback.",
  "frontend/src/components/students/StudentForm.tsx": "A reusable form component for creating or editing a Student record, with fields for basic info, contact info, and emergency contact, supporting a loading state and cancel/submit callbacks.",
  "frontend/src/components/students/StudentList.tsx": "Renders a searchable table of students with columns for ID, name, email, phone, major, year, and enrollment date. Provides view, edit, and delete action buttons per row.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and an admin token from URL params. Invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAttendanceQueries.ts": "Provides React Query hooks for fetching attendance records by student or course, recording attendance, and retrieving attendance statistics via the backend actor. Backend methods are stubbed with @ts-ignore as they are not yet implemented.",
  "frontend/src/hooks/useAuthQueries.ts": "Exposes React Query hooks for fetching and saving the caller's user profile and checking admin status against the backend actor.",
  "frontend/src/hooks/useCourseQueries.ts": "Provides React Query hooks for CRUD operations on courses (get all, get one, add, update, delete) using the backend actor.",
  "frontend/src/hooks/useEnrollmentQueries.ts": "Provides React Query hooks for managing student enrollments, including fetching all enrollments or filtering by student/course, enrolling a student, and deleting an enrollment. Backend methods are stubbed with @ts-ignore.",
  "frontend/src/hooks/useGradeQueries.ts": "Provides React Query hooks for fetching, adding, and updating student grades, plus utility functions for calculating grade statistics and detecting late submissions.",
  "frontend/src/hooks/useInstructorQueries.ts": "Provides React Query hooks for CRUD operations on instructor profiles (get all, get one, add, update, delete) using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components via a React context hook.",
  "frontend/src/hooks/useProjectQueries.ts": "Provides React Query hooks for project CRUD operations including fetching projects by student/ID, adding projects, and updating project grade/status via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Empty file with no content.",
  "frontend/src/hooks/useStudentQueries.ts": "Provides React Query hooks for student CRUD operations including fetching all students, fetching by ID, adding, updating, and deleting students via the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for a warm academic light/dark theme including colors, borders, and typography.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AttendancePage.tsx": "Placeholder attendance page that displays a header and an alert indicating backend implementation is still required.",
  "frontend/src/pages/CoursesPage.tsx": "Full-featured courses management page supporting add, edit, view, and delete operations on courses via dialogs and React Query hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview page displaying summary cards for student, course, instructor, enrollment, and grade counts fetched from backend queries.",
  "frontend/src/pages/EnrollmentsPage.tsx": "Placeholder enrollments page that displays a header and an alert indicating backend implementation is still required.",
  "frontend/src/pages/GradesPage.tsx": "Grades management page supporting add, edit, and view operations on student grades via dialogs, using React Query hooks for grades, students, and courses data.",
  "frontend/src/pages/InstructorsPage.tsx": "Page component for managing instructor profiles, supporting add/edit/view operations via dialogs with admin-gated creation controls and toast notifications.",
  "frontend/src/pages/ProjectsPage.tsx": "Simple page wrapper that renders the ProjectManager component for managing student project submissions and grades.",
  "frontend/src/pages/StudentsPage.tsx": "Page component for managing student records with add, edit, view, and delete operations via dialogs and toast feedback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH-based color tokens, extended font families, border radii, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing the Student Information System's architecture, existing features, known issues, and pending feature requests including a three-dot header menu."
}